0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 2.39);

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    rod
    {
        type            newMovingWallVelocity;
        value           uniform (0 0 0);
    }
    tube
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;        
        value           nonuniform List<vector>

720
(
(-0.060396 0.0887917 2.61829)
(-0.0683197 0.073324 2.62462)
(-0.0819084 0.074404 2.62413)
(-0.0862474 0.0572194 2.62821)
(-0.0939667 0.0601896 2.63021)
(-0.0984225 0.0385117 2.63265)
(-0.106139 0.0485309 2.63876)
(-0.096754 0.0238251 2.63512)
(-0.103319 0.0219097 2.63378)
(-0.0960232 0.000143455 2.63371)
(-0.101555 -0.01345 2.62427)
(-0.0888149 -0.0319723 2.62647)
(0.0401198 0.02346 2.57459)
(0.0408358 0.0223923 2.5851)
(0.0365405 0.0357613 2.57691)
(0.0442542 0.0299546 2.59041)
(0.0329471 0.0430406 2.58343)
(0.0471994 0.0422944 2.5998)
(0.0288093 0.0415133 2.58675)
(0.0283145 0.0379238 2.57522)
(0.0182188 0.046264 2.58881)
(0.0135639 0.041176 2.5812)
(0.00366645 0.0441801 2.58114)
(5.91765e-05 0.0405817 2.58456)
(-0.0687638 0.137945 2.51804)
(-0.0847988 0.122937 2.52832)
(-0.0995788 0.123816 2.52453)
(-0.112785 0.1065 2.53491)
(-0.12735 0.105733 2.53172)
(-0.135155 0.0851533 2.54017)
(-0.153154 0.0814353 2.53908)
(-0.15073 0.0530756 2.5398)
(-0.161824 0.0395375 2.53519)
(-0.152664 0.011545 2.53524)
(-0.15649 -0.0111624 2.52547)
(-0.13986 -0.0385247 2.52623)
(0.0475587 0.035543 2.45195)
(0.0453004 0.0345326 2.46035)
(0.0384397 0.047247 2.45195)
(0.0403043 0.0454076 2.466)
(0.0308081 0.0538181 2.45355)
(0.0359362 0.0544866 2.46973)
(0.0218016 0.0560841 2.45713)
(0.0231243 0.0522371 2.44851)
(0.0131495 0.057615 2.45517)
(0.0101002 0.0529568 2.45153)
(-0.00368257 0.0559264 2.45317)
(-0.00694785 0.0516332 2.45538)
(-0.0817954 0.197744 2.36732)
(-0.104888 0.183204 2.38224)
(-0.126638 0.180715 2.38194)
(-0.14615 0.161498 2.3967)
(-0.16768 0.154556 2.39605)
(-0.181487 0.130523 2.40681)
(-0.202562 0.117004 2.4052)
(-0.206388 0.0842154 2.40515)
(-0.218979 0.0590435 2.39737)
(-0.212591 0.0218204 2.39097)
(-0.21361 -0.0106747 2.3761)
(-0.197238 -0.0475054 2.37088)
(0.0592977 0.0699855 2.2421)
(0.0505498 0.0746552 2.25197)
(0.0374006 0.0883495 2.24201)
(0.0296919 0.0906692 2.25288)
(0.0145785 0.0960454 2.24002)
(0.00960565 0.095572 2.24569)
(-0.00559973 0.0932061 2.23666)
(-0.00693942 0.0843938 2.22647)
(-0.0177818 0.0821395 2.22737)
(-0.0186537 0.0723284 2.22264)
(-0.0313899 0.0702828 2.22569)
(-0.036331 0.0632436 2.22815)
(-0.0999156 0.242075 2.09678)
(-0.130114 0.230438 2.12343)
(-0.158145 0.220826 2.13451)
(-0.183769 0.201368 2.16296)
(-0.207517 0.185548 2.17165)
(-0.225042 0.158436 2.1895)
(-0.242138 0.136817 2.1905)
(-0.248031 0.101492 2.18391)
(-0.25433 0.0676622 2.16472)
(-0.249416 0.0248975 2.13749)
(-0.24445 -0.0166143 2.10607)
(-0.232586 -0.0591356 2.08395)
(0.081976 0.122623 1.73163)
(0.0645024 0.144962 1.74813)
(0.0431071 0.157753 1.74783)
(0.0173685 0.174941 1.76045)
(-0.0127428 0.180349 1.75223)
(-0.0416022 0.183245 1.75143)
(-0.0749015 0.173842 1.7369)
(-0.0921301 0.152297 1.70937)
(-0.100773 0.124267 1.67896)
(-0.0929406 0.0952758 1.64817)
(-0.0871164 0.0780826 1.63904)
(-0.0876165 0.0695397 1.64606)
(-0.0899696 -0.051324 2.61717)
(-0.0720705 -0.0631126 2.62152)
...
);
    }
}

// ************************************************************************* //
