0/fluid/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.938771;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    rod
    {
        type            epsilonWallFunction;
        value           uniform 0.938771;
        refValue        uniform 0;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    tube
    {
        type            epsilonWallFunction;
        value           uniform 0.938771;
        refValue        uniform 0;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    inlet
    {
        type            fixedValue;        
        value           nonuniform List<scalar>

720
(
0.60134
0.597411
0.592937
0.587507
0.584911
0.579095
0.581781
0.583016
0.583458
0.587171
0.590588
0.595298
0.74303
0.735271
0.730746
0.722157
0.719145
0.713237
0.713403
0.718113
0.722369
0.730088
0.736965
0.743514
0.950441
0.939236
0.929234
0.91773
0.91322
0.905926
0.90757
0.915531
0.924301
0.936991
0.947096
0.958981
1.23709
1.21497
1.19815
1.18098
1.17183
1.16519
1.169
1.18517
1.20314
1.23036
1.25204
1.27256
1.75001
1.71339
1.68356
1.65541
1.63509
1.62553
1.62293
1.64075
1.66609
1.71376
1.75119
1.79517
2.56415
2.48424
2.41324
2.34667
2.30682
2.28547
2.30084
2.35926
2.44427
2.57125
2.66478
2.7555
4.95651
4.89657
4.81082
4.72979
4.63408
4.56783
4.51654
4.52133
4.59405
4.74137
4.86373
5.00466
13.7966
13.9906
13.984
14.072
13.9444
13.836
13.5833
13.1993
12.8115
12.4872
12.4238
12.5765
0.598975
0.600819
...
);
    }
}


// ************************************************************************* //
