0/fluid/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0268318;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    rod
    {
        type            kqRWallFunction;
        value           uniform 0.0268318;
    }
    tube
    {
        type            kqRWallFunction;
        value           uniform 0.0268318;
    }
    inlet
    {
        type            fixedValue;        
        value           nonuniform List<scalar>

720
(
0.030236
0.0302021
0.0301431
0.0300636
0.0300231
0.0298991
0.0299153
0.029876
0.0298403
0.0298534
0.0298869
0.0299618
0.0323176
0.0322343
0.0321985
0.0320765
0.0320321
0.0319085
0.0318382
0.0318339
0.0318439
0.031905
0.0319933
0.0320933
0.0347725
0.0346765
0.0345889
0.0344603
0.0344122
0.0342919
0.0342336
0.0342416
0.0342816
0.0343616
0.034461
0.0346031
0.0372454
0.0370674
0.0369495
0.0368016
0.0367128
0.0366167
0.0365399
0.0365911
0.0366878
0.0368762
0.0370821
0.0372871
0.0404603
0.0402508
0.0401201
0.0399886
0.0398719
0.039836
0.0396901
0.0396733
0.0397274
0.0399176
0.0401388
0.0404241
0.0429278
0.0424827
0.0421535
0.0418587
0.0416938
0.0416717
0.0416409
0.0418443
0.0422257
0.0428168
0.0433382
0.0438307
0.0479889
0.0480154
0.0480026
0.0480231
0.0478057
0.0477696
0.0472975
0.0469282
0.0467525
0.0467799
0.0469612
0.0472764
0.0483297
0.0487581
0.0487247
0.0489036
0.0485811
0.0483004
0.0476795
0.0467555
0.0458443
0.0451212
0.0450382
0.045472
0.0300422
0.0301126
...
);
    }
}

// ************************************************************************* //
