0/solid/pointD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    rod
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    rod_internal
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    fixed_end
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
