constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//For Re_ann = 35,100 and u* = 83.5
//Validate from NIST data, T = 294.65 K

nu              nu [0 2 -1 0 0 0 0] 9.6797E-07; //Kinematic viscosity [m2/s]
rho             rho [1 -3 0 0 0 0 0] 997.84;  //Density [kg/m3]

transportModel  Newtonian;

// ************************************************************************* //
