constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

mechanical
(
    steel //EHD-rod
    {
        type            linearElastic;
        rho             rho [1 -3 0 0 0 0 0] 33676.3; // // Density [kg/m3]
        E               E [1 -1 -2 0 0 0 0] 202.26e9; // Young's Modulus [kg/m s2]
        nu              nu [0 0 0 0 0 0 0] 0.3; // Poisson's ratio (dx/X)
    } 
);

// ************************************************************************* //
