system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
        maxIter         1000;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
        maxIter         1000;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    cellMotionU
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
        maxIter         100;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "U|UFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
        minIter         1;
    }

    "epsilon|k|omega|f|v2|R"
    {
        solver           PBiCG;
        preconditioner   DILU;

        minIter          1;
        maxIter          500;
        tolerance        1e-06;
        relTol           0;
    };
}


PISO
{
    momentumPredictor yes;

    nCorrectors     3;
    nNonOrthogonalCorrectors 1;

    pRefCell        0;
    pRefValue       0;
}


PIMPLE
{
    momentumPredictor yes;

    nOuterCorrectors 5;    
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;

    pRefCell        0;
    pRefValue       0;

/*    residualControl
    {
    //    U               1e-3;
        "(k|epsilon|omega|f|v2|R)" 1e-3;
        U
        {
            relTol    0;
            tolerance 1e-6;
        }
        p               1e-2;
    }*/
    
}

relaxationFactors
{
    equations
    {
        U 1;
        UFinal 1;
    }
    fields
    {
        k 0.9;
        //omega 0.9;
        p               0.9;
        U              0.95; // 0.9 is more stable but 0.95 more convergent
        R               0.5; // choosing values closer to one makes simulations diverge
        epsilon         0.5; // or 0.9 to prevent the value of from blowing up
    }
}


// ************************************************************************* //
